{
  "kalimas": [
    {
      "title": "First Kalima",
      "name": "First Kalima (Tayyab)",
      "arabic": "لَلَا إِلَٰهَ إِلَّا ٱللَّٰهُ مُحَمَّدٌ رَسُولُ ٱللَّٰهِ",
      "translation_en": "There is no god but Allah, Muhammad is the Messenger of Allah",
      "translation_ur": "اللہ کے سوا کوئی معبود نہیں، محمد ﷺ اللہ کے رسول ہیں"
    },
    {
      "title": "Second Kalima",
      "name": "Second Kalima (Shahadat)",
      "arabic": "أَشْهَدُ أَنْ لَّا إِلَٰهَ إِلَّا ٱللَّٰهُ وَحْدَهُ لَا شَرِيْكَ لَهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ",
      "translation_en": "I bear witness that there is no God but Allah, He is One and has no partner. And I bear witness that Muhammad (peace be upon him) is His servant and His messenger.",
      "translation_ur": "میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی معبود نہیں، وہ اکیلا ہے، اس کا کوئی شریک نہیں۔ اور میں گواہی دیتا ہوں کہ محمد ﷺ اس کے بندے اور رسول ہیں۔"
    },
    {
      "title": "Third Kalima",
      "name": "Third Kalima (Tamjeed)",
      "arabic": "سُبْحَانَ ٱللَّٰهِ وَٱلْحَمْدُ لِلَّٰهِ وَلَا إِلَٰهَ إِلَّا ٱللَّٰهُ وَٱللَّٰهُ أَكْبَرُ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِٱللَّٰهِ ٱلْعَلِيِّ ٱلْعَظِيمِ",
      "translation_en": "Glory be to Allah, all praise is for Allah, there is no God but Allah, Allah is the Greatest. There is no power and no strength except with Allah, the Most High, the Great.",
      "translation_ur": "اللہ پاک ہے، اور تمام تعریفیں اللہ کے لیے ہیں، اور اللہ کے سوا کوئی معبود نہیں، اور اللہ سب سے بڑا ہے، اور گناہوں سے بچنے اور نیکی کرنے کی طاقت اللہ ہی کی طرف سے ہے جو بلند و برتر ہے۔"
    },
    {
      "title": "Fourth Kalima",
      "name": "Fourth Kalima (Touheed)",
      "arabic": "لَا إِلَٰهَ إِلَّا ٱللَّٰهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ ٱلْمُلْكُ وَلَهُ ٱلْحَمْدُ، يُحْيِي وَيُمِيتُ وَهُوَ حَيٌّ لَا يَمُوتُ أَبَدًا أَبَدًا، ذُو ٱلْجَلَالِ وَٱلْإِكْرَامِ بِيَدِهِ ٱلْخَيْرُ وَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
      "translation_en": "There is no God but Allah, He is One, He has no partner. His is the kingdom, and all praise belongs to Him. He gives life and causes death, and He is living and never dies. He is the Owner of Majesty and Honor. All goodness is in His hand, and He has power over everything.",
      "translation_ur":"اللہ کے سوا کوئی معبود نہیں، وہ یکتا ہے، اس کا کوئی شریک نہیں۔ اسی کی بادشاہی ہے، اسی کے لیے تعریف ہے، وہ زندگی دیتا ہے اور موت دیتا ہے، اور وہ زندہ ہے، کبھی نہیں مرے گا۔ عزت و بزرگی والا ہے، ہر خیر اسی کے ہاتھ میں ہے، اور وہ ہر چیز پر قدرت رکھتا ہے۔"
    },
    {
      "title": "Fifth Kalima",
      "name": "Fifth Kalima (Astaghfar)",
      "arabic": "أَسْتَغْفِرُ ٱللَّٰهَ رَبِّي مِنْ كُلِّ ذَنْبٍ أَذْنَبْتُهُ عَمَدًا أَوْ خَطَأً سِرًّا أوْ عَلَانِيَةً وَأَتُوبُ إِلَيْهِ مِنَ ٱلذَّنْبِ ٱلَّذِي أَعْلَمُ وَمِنَ ٱلذَّنْبِ ٱلَّذِي لَا أَعْلَمُ، إِنَّكَ أَنْتَ عَلَّامُ ٱلْغُيُوبِ وَسَتَّارُ ٱلْعُيُوْبِ وَغَفَّارُ ٱلذُّنُوبِ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِٱللَّٰهِ ٱلْعَلِيِّ ٱلْعَظِيمِ",
      "translation_en": "I seek forgiveness from Allah, my Lord, for every sin I committed knowingly or unknowingly, secretly or openly. I turn to Him in repentance for the sins I know and those I do not know. Truly, You are the Knower of the unseen, the Concealer of faults, and the Forgiver of sins. There is no power nor strength except with Allah, the Most High, the Great.",
      "translation_ur": "میں اللہ سے بخشش مانگتا ہوں، جو میرا رب ہے، ہر گناہ سے جو میں نے کیا، چاہے جان بوجھ کر، یا بھول کر، چھپ کر یا کھلم کھلا۔ اور میں اس کی طرف توبہ کرتا ہوں ان گناہوں سے جنہیں میں جانتا ہوں اور جنہیں نہیں جانتا۔ بے شک تو غیب جاننے والا، عیب چھپانے والا اور گناہ بخشنے والا ہے۔ اور گناہوں سے بچنے اور نیکی کرنے کی طاقت اللہ ہی کی طرف سے ہے، جو بلند و عظیم ہے۔"
    },
    {
      "title": "Sixth Kalima",
      "name": "Sixth Kalima (Radd-e-Kufr)",
      "arabic": "ٱللَّٰهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ أَنْ أُشْرِكَ بِكَ شَيْءً وَأَنَا أَعْلَمُ بِهِ وَأَسْتَغْفِرُكَ لِمَا لَا أَعْلَمُ بِهِ تُبْتُ عَنْهُ وَتَبَرَّأَتُ مِنَ ٱلْكُفْر وَٱلشِّرْكِ وَٱلْكِذْبِ وَٱلْغِيبَةِ وَٱلْبِدْعَةِ وَٱلنَّمِيمَةِ وَٱلْفَوَاحِشِ وَٱلْبُهْتَانِ وَٱلْمَعَاصِي كُلِِّهَا وَأَسْلَمْتُ وَأَقُولُ لَا إِلَٰهَ إِلَّا ٱللَّٰهُ مُحَمَّدٌ رَسُولُ ٱللَّٰهِ",
      "translation_en": "O Allah! I seek refuge in You from associating anything with You knowingly. And I seek Your forgiveness for what I do unknowingly. I repent from it and declare myself free from disbelief, polytheism, lies, backbiting, innovations, slander, indecency, false accusations, and all sins. I submit to Islam and declare that there is no God but Allah, and Muhammad (peace be upon him) is the Messenger of Allah.",
      "translation_ur": "اے اللہ! میں پناہ مانگتا ہوں اس سے کہ میں جان بوجھ کر تیرے ساتھ کسی کو شریک ٹھہراؤں۔ اور میں بخشش مانگتا ہوں اس شرک سے جس کا مجھے علم نہیں۔ میں نے اس سے توبہ کی اور میں کفر، شرک، جھوٹ، غیبت، بدعت، چغلی، بے حیائی، بہتان اور تمام گناہوں سے بری ہوتا ہوں۔ اور میں اسلام قبول کرتا ہوں اور کہتا ہوں کہ اللہ کے سوا کوئی معبود نہیں، محمد ﷺ اللہ کے رسول ہیں۔"
    }
  ]
}
